flamerten/ESP32S3-Alarm-Clock-FW/main/lsm6dsox/lsm6dsox_reg.h
#define LSM6DSOX_SENSOR_HUB_18                0x13U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_sensor_hub_18_t;

#define LSM6DSOX_MASTER_CONFIG                0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t aux_sens_on              : 2;
  uint8_t master_on                : 1;
  uint8_t shub_pu_en               : 1;
  uint8_t pass_through_mode        : 1;
  uint8_t start_config             : 1;
  uint8_t write_once               : 1;
  uint8_t rst_master_regs          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t rst_master_regs          : 1;
  uint8_t write_once               : 1;
  uint8_t start_config             : 1;
  uint8_t pass_through_mode        : 1;
  uint8_t shub_pu_en               : 1;
  uint8_t master_on                : 1;
  uint8_t aux_sens_on              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_master_config_t;

#define LSM6DSOX_SLV0_ADD                     0x15U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t rw_0                     : 1;
  uint8_t slave0                   : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0                   : 7;
  uint8_t rw_0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv0_add_t;

#define LSM6DSOX_SLV0_SUBADD                  0x16U
typedef struct
{
  uint8_t slave0_reg               : 8;
} lsm6dsox_slv0_subadd_t;

#define LSM6DSOX_SLV0_CONFIG                  0x17U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_numop             : 3;
  uint8_t batch_ext_sens_0_en      : 1;
  uint8_t not_used_01              : 2;
  uint8_t shub_odr                 : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t shub_odr                 : 2;
  uint8_t not_used_01              : 2;
  uint8_t batch_ext_sens_0_en      : 1;
  uint8_t slave0_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv0_config_t;

#define LSM6DSOX_SLV1_ADD                     0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_1                      : 1;
  uint8_t slave1_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_add               : 7;
  uint8_t r_1                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv1_add_t;

#define LSM6DSOX_SLV1_SUBADD                  0x19U
typedef struct
{
  uint8_t slave1_reg               : 8;
} lsm6dsox_slv1_subadd_t;

#define LSM6DSOX_SLV1_CONFIG                  0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave1_numop             : 3;
  uint8_t batch_ext_sens_1_en      : 1;
  uint8_t not_used_01              : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 4;
  uint8_t batch_ext_sens_1_en      : 1;
  uint8_t slave1_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv1_config_t;

#define LSM6DSOX_SLV2_ADD                     0x1BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_2                      : 1;
  uint8_t slave2_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave2_add               : 7;
  uint8_t r_2                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv2_add_t;

#define LSM6DSOX_SLV2_SUBADD                  0x1CU
typedef struct
{
  uint8_t slave2_reg               : 8;
} lsm6dsox_slv2_subadd_t;

#define LSM6DSOX_SLV2_CONFIG                  0x1DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave2_numop             : 3;
  uint8_t batch_ext_sens_2_en      : 1;
  uint8_t not_used_01              : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 4;
  uint8_t batch_ext_sens_2_en      : 1;
  uint8_t slave2_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv2_config_t;

#define LSM6DSOX_SLV3_ADD                     0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_3                      : 1;
  uint8_t slave3_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_add               : 7;
  uint8_t r_3                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv3_add_t;

#define LSM6DSOX_SLV3_SUBADD                  0x1FU
typedef struct
{
  uint8_t slave3_reg               : 8;
} lsm6dsox_slv3_subadd_t;

#define LSM6DSOX_SLV3_CONFIG                  0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave3_numop             : 3;
  uint8_t  batch_ext_sens_3_en     : 1;
  uint8_t not_used_01              : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 4;
  uint8_t  batch_ext_sens_3_en     : 1;
  uint8_t slave3_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_slv3_config_t;

#define LSM6DSOX_DATAWRITE_SLV0               0x21U
typedef struct
{
  uint8_t slave0_dataw             : 8;
} lsm6dsox_datawrite_slv0_t;

#define LSM6DSOX_STATUS_MASTER                0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sens_hub_endop           : 1;
  uint8_t not_used_01              : 2;
  uint8_t slave0_nack              : 1;
  uint8_t slave1_nack              : 1;
  uint8_t slave2_nack              : 1;
  uint8_t slave3_nack              : 1;
  uint8_t wr_once_done             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wr_once_done             : 1;
  uint8_t slave3_nack              : 1;
  uint8_t slave2_nack              : 1;
  uint8_t slave1_nack              : 1;
  uint8_t slave0_nack              : 1;
  uint8_t not_used_01              : 2;
  uint8_t sens_hub_endop           : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsox_status_master_t;

#define LSM6DSOX_START_FSM_ADD                0x0400U

/**
  * @defgroup LSM6DSOX_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  lsm6dsox_func_cfg_access_t               func_cfg_access;
  lsm6dsox_pin_ctrl_t                      pin_ctrl;
  lsm6dsox_s4s_tph_l_t                     s4s_tph_l;
  lsm6dsox_s4s_tph_h_t                     s4s_tph_h;
  lsm6dsox_s4s_rr_t                        s4s_rr;
  lsm6dsox_fifo_ctrl1_t                    fifo_ctrl1;
  lsm6dsox_fifo_ctrl2_t                    fifo_ctrl2;
  lsm6dsox_fifo_ctrl3_t                    fifo_ctrl3;
  lsm6dsox_fifo_ctrl4_t                    fifo_ctrl4;
  lsm6dsox_counter_bdr_reg1_t              counter_bdr_reg1;
  lsm6dsox_counter_bdr_reg2_t              counter_bdr_reg2;
  lsm6dsox_int1_ctrl_t                     int1_ctrl;
  lsm6dsox_int2_ctrl_t                     int2_ctrl;
  lsm6dsox_ctrl1_xl_t                      ctrl1_xl;
  lsm6dsox_ctrl2_g_t                       ctrl2_g;
  lsm6dsox_ctrl3_c_t                       ctrl3_c;
  lsm6dsox_ctrl4_c_t                       ctrl4_c;
  lsm6dsox_ctrl5_c_t                       ctrl5_c;
  lsm6dsox_ctrl6_c_t                       ctrl6_c;
  lsm6dsox_ctrl7_g_t                       ctrl7_g;
  lsm6dsox_ctrl8_xl_t                      ctrl8_xl;
  lsm6dsox_ctrl9_xl_t                      ctrl9_xl;
  lsm6dsox_ctrl10_c_t                      ctrl10_c;
  lsm6dsox_all_int_src_t                   all_int_src;
  lsm6dsox_wake_up_src_t                   wake_up_src;
  lsm6dsox_tap_src_t                       tap_src;
  lsm6dsox_d6d_src_t                       d6d_src;
  lsm6dsox_status_reg_t                    status_reg;
  lsm6dsox_fifo_status1_t                  fifo_status1;
  lsm6dsox_fifo_status2_t                  fifo_status2;
  lsm6dsox_ui_status_reg_ois_t             ui_status_reg_ois;
  lsm6dsox_tap_cfg0_t                      tap_cfg0;
  lsm6dsox_tap_cfg1_t                      tap_cfg1;
  lsm6dsox_tap_cfg2_t                      tap_cfg2;
  lsm6dsox_tap_ths_6d_t                    tap_ths_6d;
  lsm6dsox_int_dur2_t                      int_dur2;
  lsm6dsox_wake_up_ths_t                   wake_up_ths;
  lsm6dsox_wake_up_dur_t                   wake_up_dur;
  lsm6dsox_free_fall_t                     free_fall;
  lsm6dsox_md1_cfg_t                       md1_cfg;
  lsm6dsox_md2_cfg_t                       md2_cfg;
  lsm6dsox_s4s_st_cmd_code_t               s4s_st_cmd_code;
  lsm6dsox_s4s_dt_reg_t                    s4s_dt_reg;
  lsm6dsox_i3c_bus_avb_t                   i3c_bus_avb;
  lsm6dsox_internal_freq_fine_t            internal_freq_fine;
  lsm6dsox_ui_int_ois_t                    ui_int_ois;
  lsm6dsox_ui_ctrl1_ois_t                  ui_ctrl1_ois;
  lsm6dsox_ui_ctrl2_ois_t                  ui_ctrl2_ois;
  lsm6dsox_ui_ctrl3_ois_t                  ui_ctrl3_ois;
  lsm6dsox_fifo_data_out_tag_t             fifo_data_out_tag;
  lsm6dsox_spi2_status_reg_ois_t           spi2_status_reg_ois;
  lsm6dsox_spi2_int_ois_t                  spi2_int_ois;
  lsm6dsox_spi2_ctrl1_ois_t                spi2_ctrl1_ois;
  lsm6dsox_spi2_ctrl2_ois_t                spi2_ctrl2_ois;
  lsm6dsox_spi2_ctrl3_ois_t                spi2_ctrl3_ois;
  lsm6dsox_page_sel_t                      page_sel;
  lsm6dsox_emb_func_en_a_t                 emb_func_en_a;
  lsm6dsox_emb_func_en_b_t                 emb_func_en_b;
  lsm6dsox_page_address_t                  page_address;
  lsm6dsox_page_value_t                    page_value;
  lsm6dsox_emb_func_int1_t                 emb_func_int1;
  lsm6dsox_fsm_int1_a_t                    fsm_int1_a;
  lsm6dsox_fsm_int1_b_t                    fsm_int1_b;
  lsm6dsox_emb_func_int2_t                 emb_func_int2;
  lsm6dsox_fsm_int2_a_t                    fsm_int2_a;
  lsm6dsox_fsm_int2_b_t                    fsm_int2_b;
  lsm6dsox_emb_func_status_t               emb_func_status;
  lsm6dsox_fsm_status_a_t                  fsm_status_a;
  lsm6dsox_fsm_status_b_t                  fsm_status_b;
  lsm6dsox_page_rw_t                       page_rw;
  lsm6dsox_emb_func_fifo_cfg_t             emb_func_fifo_cfg;
  lsm6dsox_fsm_enable_a_t                  fsm_enable_a;
  lsm6dsox_fsm_enable_b_t                  fsm_enable_b;
  lsm6dsox_fsm_long_counter_clear_t        fsm_long_counter_clear;
  lsm6dsox_fsm_outs1_t                     fsm_outs1;
  lsm6dsox_fsm_outs2_t                     fsm_outs2;
  lsm6dsox_fsm_outs3_t                     fsm_outs3;
  lsm6dsox_fsm_outs4_t                     fsm_outs4;
  lsm6dsox_fsm_outs5_t                     fsm_outs5;
  lsm6dsox_fsm_outs6_t                     fsm_outs6;
  lsm6dsox_fsm_outs7_t                     fsm_outs7;
  lsm6dsox_fsm_outs8_t                     fsm_outs8;
  lsm6dsox_fsm_outs9_t                     fsm_outs9;
  lsm6dsox_fsm_outs10_t                    fsm_outs10;
  lsm6dsox_fsm_outs11_t                    fsm_outs11;
  lsm6dsox_fsm_outs12_t                    fsm_outs12;
  lsm6dsox_fsm_outs13_t                    fsm_outs13;
  lsm6dsox_fsm_outs14_t                    fsm_outs14;
  lsm6dsox_fsm_outs15_t                    fsm_outs15;
  lsm6dsox_fsm_outs16_t                    fsm_outs16;
  lsm6dsox_emb_func_odr_cfg_b_t            emb_func_odr_cfg_b;
  lsm6dsox_emb_func_odr_cfg_c_t            emb_func_odr_cfg_c;
  lsm6dsox_emb_func_src_t                  emb_func_src;
  lsm6dsox_emb_func_init_a_t               emb_func_init_a;
  lsm6dsox_emb_func_init_b_t               emb_func_init_b;
  lsm6dsox_mag_cfg_a_t                     mag_cfg_a;
  lsm6dsox_mag_cfg_b_t                     mag_cfg_b;
  lsm6dsox_pedo_cmd_reg_t                  pedo_cmd_reg;
  lsm6dsox_sensor_hub_1_t                  sensor_hub_1;
  lsm6dsox_sensor_hub_2_t                  sensor_hub_2;
  lsm6dsox_sensor_hub_3_t                  sensor_hub_3;
  lsm6dsox_sensor_hub_4_t                  sensor_hub_4;
  lsm6dsox_sensor_hub_5_t                  sensor_hub_5;
  lsm6dsox_sensor_hub_6_t                  sensor_hub_6;
  lsm6dsox_sensor_hub_7_t                  sensor_hub_7;
  lsm6dsox_sensor_hub_8_t                  sensor_hub_8;
  lsm6dsox_sensor_hub_9_t                  sensor_hub_9;
  lsm6dsox_sensor_hub_10_t                 sensor_hub_10;
  lsm6dsox_sensor_hub_11_t                 sensor_hub_11;
  lsm6dsox_sensor_hub_12_t                 sensor_hub_12;
  lsm6dsox_sensor_hub_13_t                 sensor_hub_13;
  lsm6dsox_sensor_hub_14_t                 sensor_hub_14;
  lsm6dsox_sensor_hub_15_t                 sensor_hub_15;
  lsm6dsox_sensor_hub_16_t                 sensor_hub_16;
  lsm6dsox_sensor_hub_17_t                 sensor_hub_17;
  lsm6dsox_sensor_hub_18_t                 sensor_hub_18;
  lsm6dsox_master_config_t                 master_config;
  lsm6dsox_slv0_add_t                      slv0_add;
  lsm6dsox_slv0_subadd_t                   slv0_subadd;
  lsm6dsox_slv0_config_t                   slv0_config;
  lsm6dsox_slv1_add_t                      slv1_add;
  lsm6dsox_slv1_subadd_t                   slv1_subadd;
  lsm6dsox_slv1_config_t                   slv1_config;
  lsm6dsox_slv2_add_t                      slv2_add;
  lsm6dsox_slv2_subadd_t                   slv2_subadd;
  lsm6dsox_slv2_config_t                   slv2_config;
  lsm6dsox_slv3_add_t                      slv3_add;
  lsm6dsox_slv3_subadd_t                   slv3_subadd;
  lsm6dsox_slv3_config_t                   slv3_config;
  lsm6dsox_datawrite_slv0_t                datawrite_slv0;
  lsm6dsox_status_master_t                 status_master;
  bitwise_t                                bitwise;
  uint8_t                                  byte;
} lsm6dsox_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

