flamerten/ESP32S3-Alarm-Clock-FW/main/lsm6dsox/lsm6dsox_reg.h
typedef enum
{
  LSM6DSOX_USE_SLOPE = 0,
  LSM6DSOX_USE_HPF   = 1,
} lsm6dsox_slope_fds_t;
int32_t lsm6dsox_xl_hp_path_internal_set(stmdev_ctx_t *ctx,
                                         lsm6dsox_slope_fds_t val);
int32_t lsm6dsox_xl_hp_path_internal_get(stmdev_ctx_t *ctx,
                                         lsm6dsox_slope_fds_t *val);

typedef enum
{
  LSM6DSOX_HP_FILTER_NONE     = 0x00,
  LSM6DSOX_HP_FILTER_16mHz    = 0x80,
  LSM6DSOX_HP_FILTER_65mHz    = 0x81,
  LSM6DSOX_HP_FILTER_260mHz   = 0x82,
  LSM6DSOX_HP_FILTER_1Hz04    = 0x83,
} lsm6dsox_hpm_g_t;
int32_t lsm6dsox_gy_hp_path_internal_set(stmdev_ctx_t *ctx,
                                         lsm6dsox_hpm_g_t val);
int32_t lsm6dsox_gy_hp_path_internal_get(stmdev_ctx_t *ctx,
                                         lsm6dsox_hpm_g_t *val);

typedef enum
{
  LSM6DSOX_OIS_CTRL_AUX_DATA_UI          = 0x00,
  LSM6DSOX_OIS_CTRL_AUX_DATA_UI_AUX      = 0x01,
  LSM6DSOX_OIS_CTRL_UI_AUX_DATA_UI       = 0x02,
  LSM6DSOX_OIS_CTRL_UI_AUX_DATA_UI_AUX   = 0x03,
} lsm6dsox_spi2_read_en_t;
int32_t lsm6dsox_ois_mode_set(stmdev_ctx_t *ctx,
                              lsm6dsox_spi2_read_en_t val);
int32_t lsm6dsox_ois_mode_get(stmdev_ctx_t *ctx,
                              lsm6dsox_spi2_read_en_t *val);

typedef enum
{
  LSM6DSOX_AUX_PULL_UP_DISC       = 0,
  LSM6DSOX_AUX_PULL_UP_CONNECT    = 1,
} lsm6dsox_ois_pu_dis_t;
int32_t lsm6dsox_aux_sdo_ocs_mode_set(stmdev_ctx_t *ctx,
                                      lsm6dsox_ois_pu_dis_t val);
int32_t lsm6dsox_aux_sdo_ocs_mode_get(stmdev_ctx_t *ctx,
                                      lsm6dsox_ois_pu_dis_t *val);

typedef enum
{
  LSM6DSOX_AUX_ON                    = 1,
  LSM6DSOX_AUX_ON_BY_AUX_INTERFACE   = 0,
} lsm6dsox_ois_on_t;
int32_t lsm6dsox_aux_pw_on_ctrl_set(stmdev_ctx_t *ctx,
                                    lsm6dsox_ois_on_t val);
int32_t lsm6dsox_aux_pw_on_ctrl_get(stmdev_ctx_t *ctx,
                                    lsm6dsox_ois_on_t *val);

typedef enum
{
  LSM6DSOX_USE_SAME_XL_FS        = 0,
  LSM6DSOX_USE_DIFFERENT_XL_FS   = 1,
} lsm6dsox_xl_fs_mode_t;
int32_t lsm6dsox_aux_xl_fs_mode_set(stmdev_ctx_t *ctx,
                                    lsm6dsox_xl_fs_mode_t val);
int32_t lsm6dsox_aux_xl_fs_mode_get(stmdev_ctx_t *ctx,
                                    lsm6dsox_xl_fs_mode_t *val);

int32_t lsm6dsox_aux_status_reg_get(stmdev_ctx_t *ctx,
                                    lsm6dsox_spi2_status_reg_ois_t *val);

int32_t lsm6dsox_aux_xl_flag_data_ready_get(stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t lsm6dsox_aux_gy_flag_data_ready_get(stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t lsm6dsox_aux_gy_flag_settling_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

typedef enum
{
  LSM6DSOX_AUX_DEN_ACTIVE_LOW     = 0,
  LSM6DSOX_AUX_DEN_ACTIVE_HIGH    = 1,
} lsm6dsox_den_lh_ois_t;
int32_t lsm6dsox_aux_den_polarity_set(stmdev_ctx_t *ctx,
                                      lsm6dsox_den_lh_ois_t val);
int32_t lsm6dsox_aux_den_polarity_get(stmdev_ctx_t *ctx,
                                      lsm6dsox_den_lh_ois_t *val);

typedef enum
{
  LSM6DSOX_AUX_DEN_DISABLE         = 0,
  LSM6DSOX_AUX_DEN_LEVEL_LATCH     = 3,
  LSM6DSOX_AUX_DEN_LEVEL_TRIG      = 2,
} lsm6dsox_lvl2_ois_t;
int32_t lsm6dsox_aux_den_mode_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_lvl2_ois_t val);
int32_t lsm6dsox_aux_den_mode_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_lvl2_ois_t *val);

int32_t lsm6dsox_aux_drdy_on_int2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_aux_drdy_on_int2_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  LSM6DSOX_AUX_DISABLE  = 0,
  LSM6DSOX_MODE_3_GY    = 1,
  LSM6DSOX_MODE_4_GY_XL = 3,
} lsm6dsox_ois_en_spi2_t;
int32_t lsm6dsox_aux_mode_set(stmdev_ctx_t *ctx,
                              lsm6dsox_ois_en_spi2_t val);
int32_t lsm6dsox_aux_mode_get(stmdev_ctx_t *ctx,
                              lsm6dsox_ois_en_spi2_t *val);

typedef enum
{
  LSM6DSOX_250dps_AUX  = 0,
  LSM6DSOX_125dps_AUX  = 1,
  LSM6DSOX_500dps_AUX  = 2,
  LSM6DSOX_1000dps_AUX = 4,
  LSM6DSOX_2000dps_AUX = 6,
} lsm6dsox_fs_g_ois_t;
int32_t lsm6dsox_aux_gy_full_scale_set(stmdev_ctx_t *ctx,
                                       lsm6dsox_fs_g_ois_t val);
int32_t lsm6dsox_aux_gy_full_scale_get(stmdev_ctx_t *ctx,
                                       lsm6dsox_fs_g_ois_t *val);

typedef enum
{
  LSM6DSOX_AUX_SPI_4_WIRE = 0,
  LSM6DSOX_AUX_SPI_3_WIRE = 1,
} lsm6dsox_sim_ois_t;
int32_t lsm6dsox_aux_spi_mode_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_sim_ois_t val);
int32_t lsm6dsox_aux_spi_mode_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_sim_ois_t *val);

typedef enum
{
  LSM6DSOX_351Hz39 = 0,
  LSM6DSOX_236Hz63 = 1,
  LSM6DSOX_172Hz70 = 2,
  LSM6DSOX_937Hz91 = 3,
} lsm6dsox_ftype_ois_t;
int32_t lsm6dsox_aux_gy_lp1_bandwidth_set(stmdev_ctx_t *ctx,
                                          lsm6dsox_ftype_ois_t val);
int32_t lsm6dsox_aux_gy_lp1_bandwidth_get(stmdev_ctx_t *ctx,
                                          lsm6dsox_ftype_ois_t *val);

typedef enum
{
  LSM6DSOX_AUX_HP_DISABLE = 0x00,
  LSM6DSOX_AUX_HP_Hz016   = 0x10,
  LSM6DSOX_AUX_HP_Hz065   = 0x11,
  LSM6DSOX_AUX_HP_Hz260   = 0x12,
  LSM6DSOX_AUX_HP_1Hz040  = 0x13,
} lsm6dsox_hpm_ois_t;
int32_t lsm6dsox_aux_gy_hp_bandwidth_set(stmdev_ctx_t *ctx,
                                         lsm6dsox_hpm_ois_t val);
int32_t lsm6dsox_aux_gy_hp_bandwidth_get(stmdev_ctx_t *ctx,
                                         lsm6dsox_hpm_ois_t *val);

typedef enum
{
  LSM6DSOX_ENABLE_CLAMP  = 0,
  LSM6DSOX_DISABLE_CLAMP = 1,
} lsm6dsox_st_ois_clampdis_t;
int32_t lsm6dsox_aux_gy_clamp_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_st_ois_clampdis_t val);
int32_t lsm6dsox_aux_gy_clamp_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_st_ois_clampdis_t *val);

