flamerten/ESP32S3-Alarm-Clock-FW/main/lsm6dsox/lsm6dsox_reg.h
typedef enum
{
  LSM6DSOX_EVERY_STEP     = 0,
  LSM6DSOX_COUNT_OVERFLOW = 1,
} lsm6dsox_carry_count_en_t;
int32_t lsm6dsox_pedo_int_mode_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_carry_count_en_t val);
int32_t lsm6dsox_pedo_int_mode_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_carry_count_en_t *val);

int32_t lsm6dsox_motion_flag_data_ready_get(stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t lsm6dsox_tilt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t lsm6dsox_sh_mag_sensitivity_set(stmdev_ctx_t *ctx,
                                        uint16_t val);
int32_t lsm6dsox_sh_mag_sensitivity_get(stmdev_ctx_t *ctx,
                                        uint16_t *val);

int32_t lsm6dsox_mlc_mag_sensitivity_set(stmdev_ctx_t *ctx,
                                         uint16_t val);
int32_t lsm6dsox_mlc_mag_sensitivity_get(stmdev_ctx_t *ctx,
                                         uint16_t *val);

int32_t lsm6dsox_mag_offset_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dsox_mag_offset_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsox_mag_soft_iron_set(stmdev_ctx_t *ctx, uint16_t *val);
int32_t lsm6dsox_mag_soft_iron_get(stmdev_ctx_t *ctx, uint16_t *val);

typedef enum
{
  LSM6DSOX_Z_EQ_Y     = 0,
  LSM6DSOX_Z_EQ_MIN_Y = 1,
  LSM6DSOX_Z_EQ_X     = 2,
  LSM6DSOX_Z_EQ_MIN_X = 3,
  LSM6DSOX_Z_EQ_MIN_Z = 4,
  LSM6DSOX_Z_EQ_Z     = 5,
} lsm6dsox_mag_z_axis_t;
int32_t lsm6dsox_mag_z_orient_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_mag_z_axis_t val);
int32_t lsm6dsox_mag_z_orient_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_mag_z_axis_t *val);

typedef enum
{
  LSM6DSOX_Y_EQ_Y     = 0,
  LSM6DSOX_Y_EQ_MIN_Y = 1,
  LSM6DSOX_Y_EQ_X     = 2,
  LSM6DSOX_Y_EQ_MIN_X = 3,
  LSM6DSOX_Y_EQ_MIN_Z = 4,
  LSM6DSOX_Y_EQ_Z     = 5,
} lsm6dsox_mag_y_axis_t;
int32_t lsm6dsox_mag_y_orient_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_mag_y_axis_t val);
int32_t lsm6dsox_mag_y_orient_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_mag_y_axis_t *val);

typedef enum
{
  LSM6DSOX_X_EQ_Y     = 0,
  LSM6DSOX_X_EQ_MIN_Y = 1,
  LSM6DSOX_X_EQ_X     = 2,
  LSM6DSOX_X_EQ_MIN_X = 3,
  LSM6DSOX_X_EQ_MIN_Z = 4,
  LSM6DSOX_X_EQ_Z     = 5,
} lsm6dsox_mag_x_axis_t;
int32_t lsm6dsox_mag_x_orient_set(stmdev_ctx_t *ctx,
                                  lsm6dsox_mag_x_axis_t val);
int32_t lsm6dsox_mag_x_orient_get(stmdev_ctx_t *ctx,
                                  lsm6dsox_mag_x_axis_t *val);

int32_t lsm6dsox_long_cnt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                              uint8_t *val);

typedef struct
{
  lsm6dsox_fsm_enable_a_t          fsm_enable_a;
  lsm6dsox_fsm_enable_b_t          fsm_enable_b;
} lsm6dsox_emb_fsm_enable_t;
int32_t lsm6dsox_fsm_enable_set(stmdev_ctx_t *ctx,
                                lsm6dsox_emb_fsm_enable_t *val);
int32_t lsm6dsox_fsm_enable_get(stmdev_ctx_t *ctx,
                                lsm6dsox_emb_fsm_enable_t *val);

int32_t lsm6dsox_long_cnt_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsox_long_cnt_get(stmdev_ctx_t *ctx, uint16_t *val);

typedef enum
{
  LSM6DSOX_LC_NORMAL     = 0,
  LSM6DSOX_LC_CLEAR      = 1,
  LSM6DSOX_LC_CLEAR_DONE = 2,
} lsm6dsox_fsm_lc_clr_t;
int32_t lsm6dsox_long_clr_set(stmdev_ctx_t *ctx,
                              lsm6dsox_fsm_lc_clr_t val);
int32_t lsm6dsox_long_clr_get(stmdev_ctx_t *ctx,
                              lsm6dsox_fsm_lc_clr_t *val);

typedef struct
{
  lsm6dsox_fsm_outs1_t    fsm_outs1;
  lsm6dsox_fsm_outs2_t    fsm_outs2;
  lsm6dsox_fsm_outs3_t    fsm_outs3;
  lsm6dsox_fsm_outs4_t    fsm_outs4;
  lsm6dsox_fsm_outs5_t    fsm_outs5;
  lsm6dsox_fsm_outs6_t    fsm_outs6;
  lsm6dsox_fsm_outs7_t    fsm_outs7;
  lsm6dsox_fsm_outs8_t    fsm_outs8;
  lsm6dsox_fsm_outs1_t    fsm_outs9;
  lsm6dsox_fsm_outs2_t    fsm_outs10;
  lsm6dsox_fsm_outs3_t    fsm_outs11;
  lsm6dsox_fsm_outs4_t    fsm_outs12;
  lsm6dsox_fsm_outs5_t    fsm_outs13;
  lsm6dsox_fsm_outs6_t    fsm_outs14;
  lsm6dsox_fsm_outs7_t    fsm_outs15;
  lsm6dsox_fsm_outs8_t    fsm_outs16;
} lsm6dsox_fsm_out_t;
int32_t lsm6dsox_fsm_out_get(stmdev_ctx_t *ctx,
                             lsm6dsox_fsm_out_t *val);

typedef enum
{
  LSM6DSOX_ODR_FSM_12Hz5 = 0,
  LSM6DSOX_ODR_FSM_26Hz  = 1,
  LSM6DSOX_ODR_FSM_52Hz  = 2,
  LSM6DSOX_ODR_FSM_104Hz = 3,
} lsm6dsox_fsm_odr_t;
int32_t lsm6dsox_fsm_data_rate_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_fsm_odr_t val);
int32_t lsm6dsox_fsm_data_rate_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_fsm_odr_t *val);

int32_t lsm6dsox_fsm_init_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_fsm_init_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_long_cnt_int_value_set(stmdev_ctx_t *ctx,
                                        uint16_t val);
int32_t lsm6dsox_long_cnt_int_value_get(stmdev_ctx_t *ctx,
                                        uint16_t *val);

int32_t lsm6dsox_fsm_number_of_programs_set(stmdev_ctx_t *ctx,
                                            uint8_t val);
int32_t lsm6dsox_fsm_number_of_programs_get(stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t lsm6dsox_fsm_start_address_set(stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t lsm6dsox_fsm_start_address_get(stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t lsm6dsox_mlc_status_get(stmdev_ctx_t *ctx,
                                lsm6dsox_mlc_status_mainpage_t *val);

typedef enum
{
  LSM6DSOX_ODR_PRGS_12Hz5 = 0,
  LSM6DSOX_ODR_PRGS_26Hz  = 1,
  LSM6DSOX_ODR_PRGS_52Hz  = 2,
  LSM6DSOX_ODR_PRGS_104Hz = 3,
} lsm6dsox_mlc_odr_t;
int32_t lsm6dsox_mlc_data_rate_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_mlc_odr_t val);
int32_t lsm6dsox_mlc_data_rate_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_mlc_odr_t *val);

typedef struct
{
  lsm6dsox_sensor_hub_1_t   sh_byte_1;
  lsm6dsox_sensor_hub_2_t   sh_byte_2;
  lsm6dsox_sensor_hub_3_t   sh_byte_3;
  lsm6dsox_sensor_hub_4_t   sh_byte_4;
  lsm6dsox_sensor_hub_5_t   sh_byte_5;
  lsm6dsox_sensor_hub_6_t   sh_byte_6;
  lsm6dsox_sensor_hub_7_t   sh_byte_7;
  lsm6dsox_sensor_hub_8_t   sh_byte_8;
  lsm6dsox_sensor_hub_9_t   sh_byte_9;
  lsm6dsox_sensor_hub_10_t  sh_byte_10;
  lsm6dsox_sensor_hub_11_t  sh_byte_11;
  lsm6dsox_sensor_hub_12_t  sh_byte_12;
  lsm6dsox_sensor_hub_13_t  sh_byte_13;
  lsm6dsox_sensor_hub_14_t  sh_byte_14;
  lsm6dsox_sensor_hub_15_t  sh_byte_15;
  lsm6dsox_sensor_hub_16_t  sh_byte_16;
  lsm6dsox_sensor_hub_17_t  sh_byte_17;
  lsm6dsox_sensor_hub_18_t  sh_byte_18;
} lsm6dsox_emb_sh_read_t;
int32_t lsm6dsox_sh_read_data_raw_get(stmdev_ctx_t *ctx,
                                      lsm6dsox_emb_sh_read_t *val,
                                      uint8_t len);

