flamerten/ESP32S3-Alarm-Clock-FW/main/lsm6dsox/lsm6dsox_reg.h
typedef enum
{
  LSM6DSOX_XL_UI_OFF       = 0x00, /* in power down */
  LSM6DSOX_XL_UI_1Hz6_LP   = 0x1B, /* @1Hz6 (low power) */
  LSM6DSOX_XL_UI_1Hz6_ULP  = 0x2B, /* @1Hz6 (ultra low/Gy, OIS imu off) */
  LSM6DSOX_XL_UI_12Hz5_HP  = 0x01, /* @12Hz5 (high performance) */
  LSM6DSOX_XL_UI_12Hz5_LP  = 0x11, /* @12Hz5 (low power) */
  LSM6DSOX_XL_UI_12Hz5_ULP = 0x21, /* @12Hz5 (ultra low/Gy, OIS imu off) */
  LSM6DSOX_XL_UI_26Hz_HP   = 0x02, /* @26Hz  (high performance) */
  LSM6DSOX_XL_UI_26Hz_LP   = 0x12, /* @26Hz  (low power) */
  LSM6DSOX_XL_UI_26Hz_ULP  = 0x22, /* @26Hz  (ultra low/Gy, OIS imu off) */
  LSM6DSOX_XL_UI_52Hz_HP   = 0x03, /* @52Hz  (high performance) */
  LSM6DSOX_XL_UI_52Hz_LP   = 0x13, /* @52Hz  (low power) */
  LSM6DSOX_XL_UI_52Hz_ULP  = 0x23, /* @52Hz  (ultra low/Gy, OIS imu off) */
  LSM6DSOX_XL_UI_104Hz_HP  = 0x04, /* @104Hz (high performance) */
  LSM6DSOX_XL_UI_104Hz_NM  = 0x14, /* @104Hz (normal mode) */
  LSM6DSOX_XL_UI_104Hz_ULP = 0x24, /* @104Hz (ultra low/Gy, OIS imu off) */
  LSM6DSOX_XL_UI_208Hz_HP  = 0x05, /* @208Hz (high performance) */
  LSM6DSOX_XL_UI_208Hz_NM  = 0x15, /* @208Hz (normal mode) */
  LSM6DSOX_XL_UI_208Hz_ULP = 0x25, /* @208Hz (ultra low/Gy, OIS imu off) */
  LSM6DSOX_XL_UI_416Hz_HP  = 0x06, /* @416Hz (high performance) */
  LSM6DSOX_XL_UI_833Hz_HP  = 0x07, /* @833Hz (high performance) */
  LSM6DSOX_XL_UI_1667Hz_HP = 0x08, /* @1kHz66 (high performance) */
  LSM6DSOX_XL_UI_3333Hz_HP = 0x09, /* @3kHz33 (high performance) */
  LSM6DSOX_XL_UI_6667Hz_HP = 0x0A, /* @6kHz66 (high performance) */
} lsm6dsox_ui_xl_odr_t;

typedef enum
{
  LSM6DSOX_XL_UI_2g   = 0,
  LSM6DSOX_XL_UI_4g   = 2,
  LSM6DSOX_XL_UI_8g   = 3,
  LSM6DSOX_XL_UI_16g  = 1, /* OIS full scale is also forced to be 16g */
} lsm6dsox_ui_xl_fs_t;

typedef enum
{
  LSM6DSOX_GY_UI_OFF       = 0x00, /* gy in power down */
  LSM6DSOX_GY_UI_12Hz5_LP  = 0x11, /* gy @12Hz5 (low power) */
  LSM6DSOX_GY_UI_12Hz5_HP  = 0x01, /* gy @12Hz5 (high performance) */
  LSM6DSOX_GY_UI_26Hz_LP   = 0x12, /* gy @26Hz  (low power) */
  LSM6DSOX_GY_UI_26Hz_HP   = 0x02, /* gy @26Hz  (high performance) */
  LSM6DSOX_GY_UI_52Hz_LP   = 0x13, /* gy @52Hz  (low power) */
  LSM6DSOX_GY_UI_52Hz_HP   = 0x03, /* gy @52Hz  (high performance) */
  LSM6DSOX_GY_UI_104Hz_NM  = 0x14, /* gy @104Hz (low power) */
  LSM6DSOX_GY_UI_104Hz_HP  = 0x04, /* gy @104Hz (high performance) */
  LSM6DSOX_GY_UI_208Hz_NM  = 0x15, /* gy @208Hz (low power) */
  LSM6DSOX_GY_UI_208Hz_HP  = 0x05, /* gy @208Hz (high performance) */
  LSM6DSOX_GY_UI_416Hz_HP  = 0x06, /* gy @416Hz (high performance) */
  LSM6DSOX_GY_UI_833Hz_HP  = 0x07, /* gy @833Hz (high performance) */
  LSM6DSOX_GY_UI_1667Hz_HP = 0x08, /* gy @1kHz66 (high performance) */
  LSM6DSOX_GY_UI_3333Hz_HP = 0x09, /* gy @3kHz33 (high performance) */
  LSM6DSOX_GY_UI_6667Hz_HP = 0x0A, /* gy @6kHz66 (high performance) */
} lsm6dsox_ui_gy_odr_t;

typedef enum
{
  LSM6DSOX_GY_UI_250dps   = 0,
  LSM6DSOX_GY_UI_125dps   = 1,
  LSM6DSOX_GY_UI_500dps   = 2,
  LSM6DSOX_GY_UI_1000dps  = 4,
  LSM6DSOX_GY_UI_2000dps  = 6,
} lsm6dsox_ui_gy_fs_t;

typedef enum
{
  LSM6DSOX_OIS_ONLY_AUX    = 0x00, /* Auxiliary SPI full control */
  LSM6DSOX_OIS_ONLY_UI     = 0x02, /* Primary interface full control */
  LSM6DSOX_OIS_MIXED       = 0x01, /* Enabling by UI / read-config by AUX */
} lsm6dsox_ois_ctrl_md_t;

typedef enum
{
  LSM6DSOX_XL_OIS_OFF       = 0x00, /* in power down */
  LSM6DSOX_XL_OIS_6667Hz_HP = 0x01, /* @6kHz OIS imu active/NO ULP on UI */
} lsm6dsox_ois_xl_odr_t;

typedef enum
{
  LSM6DSOX_XL_OIS_2g   = 0,
  LSM6DSOX_XL_OIS_4g   = 2,
  LSM6DSOX_XL_OIS_8g   = 3,
  LSM6DSOX_XL_OIS_16g  = 1, /* UI full scale is also forced to be 16g */
} lsm6dsox_ois_xl_fs_t;

typedef enum
{
  LSM6DSOX_GY_OIS_OFF       = 0x00, /* in power down */
  LSM6DSOX_GY_OIS_6667Hz_HP = 0x01, /* @6kHz No Ultra Low Power*/
} lsm6dsox_ois_gy_odr_t;

typedef enum
{
  LSM6DSOX_GY_OIS_250dps   = 0,
  LSM6DSOX_GY_OIS_125dps   = 1,
  LSM6DSOX_GY_OIS_500dps   = 2,
  LSM6DSOX_GY_OIS_1000dps  = 4,
  LSM6DSOX_GY_OIS_2000dps  = 6,
} lsm6dsox_ois_gy_fs_t;

typedef enum
{
  LSM6DSOX_FSM_DISABLE = 0x00,
  LSM6DSOX_FSM_XL      = 0x01,
  LSM6DSOX_FSM_GY      = 0x02,
  LSM6DSOX_FSM_XL_GY   = 0x03,
} lsm6dsox_fsm_sens_t;

typedef enum
{
  LSM6DSOX_MLC_DISABLE = 0x00,
  LSM6DSOX_MLC_XL      = 0x01,
  LSM6DSOX_MLC_XL_GY   = 0x03,
} lsm6dsox_mlc_sens_t;

typedef struct
{
  struct
  {
    struct
    {
      lsm6dsox_ui_xl_odr_t odr;
      lsm6dsox_ui_xl_fs_t fs;
    } xl;
    struct
    {
      lsm6dsox_ui_gy_odr_t odr;
      lsm6dsox_ui_gy_fs_t fs;
    } gy;
  } ui;
  struct
  {
    lsm6dsox_ois_ctrl_md_t ctrl_md;
    struct
    {
      lsm6dsox_ois_xl_odr_t odr;
      lsm6dsox_ois_xl_fs_t fs;
    } xl;
    struct
    {
      lsm6dsox_ois_gy_odr_t odr;
      lsm6dsox_ois_gy_fs_t fs;
    } gy;
  } ois;
  struct
  {
    lsm6dsox_fsm_sens_t sens;
    lsm6dsox_fsm_odr_t odr;
  } fsm;
  struct
  {
    lsm6dsox_mlc_sens_t sens;
    lsm6dsox_mlc_odr_t odr;
  } mlc;
} lsm6dsox_md_t;
int32_t lsm6dsox_mode_set(stmdev_ctx_t *ctx, stmdev_ctx_t *aux_ctx,
                          lsm6dsox_md_t *val);
int32_t lsm6dsox_mode_get(stmdev_ctx_t *ctx, stmdev_ctx_t *aux_ctx,
                          lsm6dsox_md_t *val);

typedef struct
{
  struct
  {
    struct
    {
      float_t mg[3];
      int16_t raw[3];
    } xl;
    struct
    {
      float_t mdps[3];
      int16_t raw[3];
    } gy;
    struct
    {
      float_t deg_c;
      int16_t raw;
    } heat;
  } ui;
  struct
  {
    struct
    {
      float_t mg[3];
      int16_t raw[3];
    } xl;
    struct
    {
      float_t mdps[3];
      int16_t raw[3];
    } gy;
  } ois;
} lsm6dsox_data_t;
int32_t lsm6dsox_data_get(stmdev_ctx_t *ctx, stmdev_ctx_t *aux_ctx,
                          lsm6dsox_md_t *md, lsm6dsox_data_t *data);

typedef struct
{
  uint8_t sig_mot      : 1; /* significant motion */
  uint8_t tilt         : 1; /* tilt detection  */
  uint8_t step         : 1; /* step counter/detector */
  uint8_t mlc          : 1; /* machine learning core */
  uint8_t fsm          : 1; /* finite state machine */
  uint8_t fifo_compr   : 1; /* mlc 8 interrupt event */
} lsm6dsox_emb_sens_t;
int32_t lsm6dsox_embedded_sens_set(stmdev_ctx_t *ctx,
                                   lsm6dsox_emb_sens_t *emb_sens);
int32_t lsm6dsox_embedded_sens_get(stmdev_ctx_t *ctx,
                                   lsm6dsox_emb_sens_t *emb_sens);
int32_t lsm6dsox_embedded_sens_off(stmdev_ctx_t *ctx);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*LSM6DSOX_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
